# Creating Pandas DataFrame

In [1]:
import pandas as pd

In [5]:
l = [1,2,3,4,5]
print(l)

[1, 2, 3, 4, 5]

In [6]:
pd.DataFrame(l, columns = ["value"])

   value
0      1
1      2
2      3
3      4
4      5

In [7]:
import numpy as np

In [9]:
m = np.arange(1, 10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [13]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

# df naming

In [16]:
df.columns = ("a1","a2","a3")
df

   a1  a2  a3
0   1   2   3
1   4   5   6
2   7   8   9

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['a1', 'a2', 'a3'], dtype='object')]

In [19]:
df.ndim

2

In [20]:
df.shape

(3, 3)

In [21]:
df.size

9

In [22]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [23]:
type(df.values)

numpy.ndarray

In [24]:
df.head

<bound method NDFrame.head of    a1  a2  a3
0   1   2   3
1   4   5   6
2   7   8   9>

In [26]:
df.tail

<bound method NDFrame.tail of    a1  a2  a3
0   1   2   3
1   4   5   6
2   7   8   9>

In [30]:
df.tail(2)

   a1  a2  a3
1   4   5   6
2   7   8   9

In [31]:
a = np.array([1,2,3,4,5])

In [32]:
pd.DataFrame(a, columns = ["var_1"])

   var_1
0      1
1      2
2      3
3      4
4      5